Infineon/psoc6hal/COMPONENT_PSOC6HAL/source/cyhal_adc.c
    IRQn_Type irqn = _CYHAL_UTILS_GET_CURRENT_IRQN();
    uint8_t block = _cyhal_adc_get_block_from_irqn(irqn);
    cyhal_adc_t* obj = _cyhal_adc_config_structs[block];
    Cy_SAR_ClearInterrupt(obj->base, CY_SAR_INTR_EOS_MASK);
    obj->conversion_complete = true;

    uint8_t num_channels = _cyhal_adc_max_configured_channel(obj) + 1;
    if(obj->async_scans_remaining > 0)
    {
        /* Can't read millivolts out via DMA */
        if(CYHAL_ASYNC_SW == obj->async_mode || obj->async_transfer_in_uv)
        {
            for(int i = 0; i < num_channels; ++i)
            {
                int32_t counts = Cy_SAR_GetResult32(obj->base, i);
                *obj->async_buff = obj->async_transfer_in_uv ? Cy_SAR_CountsTo_uVolts(obj->base, i, counts) : counts;
                ++obj->async_buff;
            }
            --(obj->async_scans_remaining);

            if(0 == obj->async_scans_remaining)
            {
                obj->async_buff = NULL;
                hal_event |= CYHAL_ADC_ASYNC_READ_COMPLETE;
            }
            else if(false == obj->continuous_scanning)
            {
                Cy_SAR_StartConvert(obj->base, CY_SAR_START_CONVERT_SINGLE_SHOT);
            }
            /* If we're continously scanning, another scan will be kicked off automatically
             * so we don't need to do anything */
        }
        else
        {
            CY_ASSERT(CYHAL_ASYNC_DMA == obj->async_mode);
            cyhal_dma_cfg_t dma_config =
            {
                .src_addr = (uint32_t)obj->base->CHAN_RESULT,
                .src_increment = 1u,
                .dst_addr = (uint32_t)obj->async_buff,
                .dst_increment = 1u,
                .transfer_width = 16u,
                .length = num_channels,
                .burst_size = 0u,
                .action = CYHAL_DMA_TRANSFER_FULL
            };

            /* The upper half word of the result are mirrored status bits.
             * We don't want to copy these into the result buffer, so we want to do
             * 16-bit transfers and skip every other half-word. But the peripheral registers
             * only support 32-bit reads, so we need to tell the DMA to read 4 bytes but only
             * transfer 2. The HAL API doesn't support this right now, so we have to manipulate the
             * underlying descriptor directly. */
#if defined(CY_IP_M4CPUSS_DMA)
            if(obj->dma.resource.type == CYHAL_RSC_DW)
            {
                obj->dma.descriptor_config.dw.srcTransferSize = CY_DMA_TRANSFER_SIZE_WORD;
                obj->dma.descriptor_config.dw.dstTransferSize = CY_DMA_TRANSFER_SIZE_WORD;
            }
#endif
#if defined(CY_IP_M4CPUSS_DMAC)
            if(obj->dma.resource.type == CYHAL_RSC_DMA)
            {
                obj->dma.descriptor_config.dmac.srcTransferSize = CY_DMAC_TRANSFER_SIZE_WORD;
                obj->dma.descriptor_config.dmac.dstTransferSize = CY_DMAC_TRANSFER_SIZE_WORD;
            }
#endif
            // Configure needs to happen after we've manipulated the descriptor config
            cy_rslt_t result = cyhal_dma_configure(&(obj->dma), &dma_config);
            if(CY_RSLT_SUCCESS == result)
            {
                result = cyhal_dma_start_transfer(&(obj->dma));
            }
            CY_ASSERT(CY_RSLT_SUCCESS == result);

            /* Don't increment the buffer here - do that when the DMA completes */

            if(false == obj->continuous_scanning)
            {
                Cy_SAR_StartConvert(obj->base, CY_SAR_START_CONVERT_SINGLE_SHOT);
            }
        }
    }

    if(0 != (hal_event & ((cyhal_adc_event_t)obj->user_enabled_events)))
    {
        cyhal_adc_event_callback_t callback = (cyhal_adc_event_callback_t)obj->callback_data.callback;
        if(NULL != callback)
        {
            callback(obj->callback_data.callback_arg, (cyhal_adc_event_t)(hal_event & obj->user_enabled_events));
        }
    }

}

static void _cyhal_adc_dma_handler(void* arg, cyhal_dma_event_t event)
{
    CY_ASSERT(CYHAL_DMA_TRANSFER_COMPLETE == event);
    CY_UNUSED_PARAMETER(event);
    cyhal_adc_t* obj = (cyhal_adc_t*)arg;
    CY_ASSERT(CYHAL_ASYNC_DMA == obj->async_mode);

    uint8_t num_channels = _cyhal_adc_max_configured_channel(obj) + 1;
    CY_ASSERT(false == obj->async_transfer_in_uv);
    obj->async_buff += num_channels;
    --(obj->async_scans_remaining);

    if(0 == obj->async_scans_remaining)
    {
        obj->async_buff = NULL;
        if(0 != (CYHAL_ADC_ASYNC_READ_COMPLETE & ((cyhal_adc_event_t)obj->user_enabled_events)))
        {
            cyhal_adc_event_callback_t callback = (cyhal_adc_event_callback_t)obj->callback_data.callback;
            if(NULL != callback)
            {
                callback(obj->callback_data.callback_arg, CYHAL_ADC_ASYNC_READ_COMPLETE);
            }
        }
    }
}

/*******************************************************************************
*       ADC HAL Functions
*******************************************************************************/

cy_rslt_t cyhal_adc_init(cyhal_adc_t *obj, cyhal_gpio_t pin, const cyhal_clock_t *clk)
{
    const uint32_t DESIRED_DIVIDER = 8000000u; // 8 MHz. Required range is 1.7 - 18

    CY_ASSERT(NULL != obj);

    cy_rslt_t result = CY_RSLT_SUCCESS;

    memset(obj, 0, sizeof(cyhal_adc_t));
    obj->clock.div_num = CYHAL_RSC_INVALID;
    obj->resource.type = CYHAL_RSC_INVALID;
    obj->async_mode = CYHAL_ASYNC_SW;

    const cyhal_resource_pin_mapping_t* map = _cyhal_utils_try_alloc(pin, cyhal_pin_map_pass_sarmux_pads, sizeof(cyhal_pin_map_pass_sarmux_pads) / sizeof(cyhal_pin_map_pass_sarmux_pads[0]));

    if (NULL == map)
        result = CYHAL_ADC_RSLT_BAD_ARGUMENT;

    cyhal_resource_inst_t adc_inst;
    if (CY_RSLT_SUCCESS == result)
    {
        adc_inst = *map->inst;
        /* No need to reserve - try_alloc did so for us already */
    }

    en_clk_dst_t pclk = (en_clk_dst_t)0;
    if (CY_RSLT_SUCCESS == result)
    {
        obj->resource = adc_inst;

