Infineon/psoc6hal/COMPONENT_PSOC6HAL/source/cyhal_adc.c
        obj->base = _cyhal_adc_base[adc_inst.block_num];
        pclk = (en_clk_dst_t)(_cyhal_adc_clock[adc_inst.block_num]);
        if (NULL != clk)
        {
            obj->clock = *clk;
            obj->dedicated_clock = false;
        }
        else if (CY_RSLT_SUCCESS ==
            (result = _cyhal_utils_allocate_clock(&(obj->clock), &(obj->resource), CYHAL_CLOCK_BLOCK_PERIPHERAL_16BIT, true)))
        {
            obj->dedicated_clock = true;
        }
    }

    if (CY_RSLT_SUCCESS == result)
    {
        if (CY_SYSCLK_SUCCESS != Cy_SysClk_PeriphAssignDivider(pclk, obj->clock.div_type, obj->clock.div_num))
            result = CYHAL_ADC_RSLT_FAILED_CLOCK;
    }

    if (CY_RSLT_SUCCESS == result)
    {
        if(obj->dedicated_clock)
        {
            uint32_t div = Cy_SysClk_ClkPeriGetFrequency() / DESIRED_DIVIDER;
            if (0 == div ||
                CY_SYSCLK_SUCCESS != Cy_SysClk_PeriphSetDivider(obj->clock.div_type, obj->clock.div_num, div - 1) ||
                CY_SYSCLK_SUCCESS != Cy_SysClk_PeriphEnableDivider(obj->clock.div_type, obj->clock.div_num))
            {
                result = CYHAL_ADC_RSLT_FAILED_CLOCK;
            }
        }
    }

    cy_stc_sar_config_t pdl_config;
    if (CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_adc_populate_pdl_config(&_CYHAL_ADC_DEFAULT_CONFIG, &pdl_config);
    }

    if (result == CY_RSLT_SUCCESS)
    {
        result = (cy_rslt_t)Cy_SAR_Init(obj->base, &pdl_config);
    }

    if (result == CY_RSLT_SUCCESS)
    {
        Cy_SAR_SetVssaSarSeqCtrl(obj->base, CY_SAR_SWITCH_SEQ_CTRL_ENABLE);
        Cy_SAR_SetVssaVminusSwitch(obj->base, CY_SAR_SWITCH_CLOSE);

        _cyhal_analog_init();

        _cyhal_adc_config_structs[obj->resource.block_num] = obj;
        cy_stc_sysint_t irqCfg = { _cyhal_adc_irq_n[obj->resource.block_num], CYHAL_ISR_PRIORITY_DEFAULT };
        Cy_SysInt_Init(&irqCfg, _cyhal_adc_irq_handler);
        NVIC_EnableIRQ(_cyhal_adc_irq_n[obj->resource.block_num]);

        /* We always need to listen to the EOS interrupt for internal bookkeeping */
        Cy_SAR_SetInterruptMask(obj->base, CY_SAR_INTR_EOS_MASK);
        Cy_SAR_Enable(obj->base);
    }
    else
    {
        cyhal_adc_free(obj);
    }
    return result;
}

void cyhal_adc_free(cyhal_adc_t *obj)
{
    if (NULL != obj && NULL != obj->base)
    {
        IRQn_Type irqn = _cyhal_adc_irq_n[obj->resource.block_num];
        NVIC_DisableIRQ(irqn);
        _cyhal_adc_config_structs[obj->resource.block_num] = NULL;

        Cy_SAR_SetVssaSarSeqCtrl(obj->base, CY_SAR_SWITCH_SEQ_CTRL_DISABLE);
        Cy_SAR_SetVssaVminusSwitch(obj->base, CY_SAR_SWITCH_OPEN);
        Cy_SAR_Disable(obj->base);

        if(obj->dedicated_clock)
        {
            Cy_SysClk_PeriphDisableDivider(obj->clock.div_type, obj->clock.div_num);
            cyhal_hwmgr_free_clock(&obj->clock);
        }

        _cyhal_analog_free();
        cyhal_hwmgr_free(&obj->resource);
        obj->base = NULL;
    }
}

cy_rslt_t _cyhal_adc_populate_acquisition_timers(cyhal_adc_t* obj)
{
    const uint32_t ACQUISITION_CLOCKS_MIN = 2;
    const uint32_t ACQUISITION_CLOCKS_MAX = 1023;

    cy_rslt_t result = CY_RSLT_SUCCESS;

    uint32_t clock_frequency_hz = cyhal_clock_get_frequency(&(obj->clock));
    uint32_t clock_period_ns = (clock_frequency_hz > 0)
        ? _CYHAL_UTILS_NS_PER_SECOND / clock_frequency_hz
        : 0;
    uint16_t sample_timer_ns[] = { 0u, 0u, 0u, 0u };
    uint8_t assigned_timer[CY_SAR_MAX_NUM_CHANNELS];
    for(uint8_t channel = 0; channel < CY_SAR_MAX_NUM_CHANNELS; ++channel)
    {
        cyhal_adc_channel_t* chan_config = obj->channel_config[channel];
        assigned_timer[channel] = 0u;
        /* If the channel isn't in use, what we select doesn't matter */
        if(NULL != chan_config)
        {
            bool found = false;
            for(uint8_t timer = 0; timer < sizeof(sample_timer_ns) / sizeof(sample_timer_ns[0]); ++timer)
            {
                if(chan_config->minimum_acquisition_ns == sample_timer_ns[timer])
                {
                    /* Matched a pre-existing timer; use that */
                    assigned_timer[channel] = timer;
                    found = true;
                    break;
                }
                else if(0 == sample_timer_ns[timer])
                {
                    /* Found a free timer - allocate and use that */
                    sample_timer_ns[timer] = chan_config->minimum_acquisition_ns;
                    assigned_timer[channel] = timer;
                    found = true;
                    break;
                }
            }

            if(false == found)
            {
                /* Ran out of acquisition timers */
                result = CYHAL_ADC_RSLT_BAD_ARGUMENT;
            }
        }
    }

    if(CY_RSLT_SUCCESS == result)
    {
        uint16_t sample_timer_clocks[sizeof(sample_timer_ns) / sizeof(sample_timer_ns[0])];
        for(uint8_t i = 0; i < sizeof(sample_timer_clocks) / sizeof(sample_timer_clocks[0]); ++i)
        {
            /* Convert from nanoseconds to clock cycles, rounding up */
            uint32_t clock_cycles = (sample_timer_ns[i] + (clock_period_ns / 2)) / clock_period_ns;
            if(clock_cycles < ACQUISITION_CLOCKS_MIN)
            {
                clock_cycles = ACQUISITION_CLOCKS_MIN;
            }
            else if(clock_cycles > ACQUISITION_CLOCKS_MAX)
            {
                clock_cycles = ACQUISITION_CLOCKS_MAX;
            }
            /* Per the register map, this should be one greater than the actual desired sampling cycle count */
            sample_timer_clocks[i] = clock_cycles + 1;
        }

        obj->base->SAMPLE_TIME01 =
            (sample_timer_clocks[0] << CY_SAR_SAMPLE_TIME0_SHIFT) | (sample_timer_clocks[1] << CY_SAR_SAMPLE_TIME1_SHIFT);
        obj->base->SAMPLE_TIME23 =
            (sample_timer_clocks[2] << CY_SAR_SAMPLE_TIME2_SHIFT) | (sample_timer_clocks[3] << CY_SAR_SAMPLE_TIME3_SHIFT);

