Infineon/psoc6hal/COMPONENT_PSOC6HAL/source/cyhal_adc.c
/*******************************************************************************
*       ADC Channel HAL Functions
*******************************************************************************/

uint32_t _cyhal_adc_channel_convert_config(const cyhal_adc_channel_config_t* config, cyhal_gpio_t vplus, cyhal_gpio_t vminus)
{
    uint32_t result = (uint32_t)CY_SAR_CHAN_SAMPLE_TIME_0  /* Placeholder, will be updated by populate_acquisition_timers */
                        | config->enable_averaging ? (uint32_t)CY_SAR_CHAN_AVG_ENABLE : (uint32_t)CY_SAR_CHAN_AVG_DISABLE
                        | (uint32_t)CY_SAR_POS_PORT_ADDR_SARMUX
                        | _cyhal_adc_get_pin_addr(vplus, true);

    if(vminus == NC)
    {
        /* Single-ended channel */
        result |= (uint32_t)CY_SAR_CHAN_SINGLE_ENDED;
    }
    else
    {
        /* Differential */
        result |= (uint32_t)CY_SAR_NEG_PORT_ADDR_SARMUX;
        result |= (uint32_t)CY_SAR_CHAN_DIFFERENTIAL_UNPAIRED;
        result |= _cyhal_adc_get_pin_addr(vminus, false);
    }

    return result;
}

static void _cyhal_adc_update_chan_offset(cyhal_adc_channel_t* obj)
{
    /* Normally, the PDL sets the offset in the ADC init. But we change the channel config after we initialize
     * the ADC itself, so we need to set the offset appropriately here. Otherwise the _uv functions will not
     * work correctly.
     * The conditions in the PDL are: singleEnded && vrefNegSelect && singleEndedSigned. We always operate
     * in signed mode so we only need to check the first two.
    */
    bool single_ended = (CYHAL_ADC_VNEG == obj->vminus);
    bool neg_sel_vref = ((uint32_t)CY_SAR_NEG_SEL_VREF == (obj->adc->base->CTRL & SAR_CTRL_NEG_SEL_Msk));
    int16_t offset = (single_ended && neg_sel_vref) ? (-1 * ((int16_t) (CY_SAR_WRK_MAX_12BIT / 2))) : 0;
#if CY_IP_MXS40PASS_SAR_INSTANCES < 2
    Cy_SAR_SetOffset(obj->channel_idx, offset);
#else
    Cy_SAR_SetChannelOffset(obj->adc->base, obj->channel_idx, offset);
#endif
}

static const cyhal_resource_pin_mapping_t* _cyhal_adc_find_matching_resource(cyhal_resource_inst_t* adc, cyhal_gpio_t pin, const cyhal_resource_pin_mapping_t *pin_map, size_t count)
{
    for (uint32_t i = 0; i < count; i++)
    {
        if (pin == pin_map[i].pin && _cyhal_utils_resources_equal(adc, pin_map[i].inst))
        {
            return &pin_map[i];
        }
    }
    return NULL;
}

cy_rslt_t cyhal_adc_channel_init_diff(cyhal_adc_channel_t *obj, cyhal_adc_t* adc, cyhal_gpio_t vplus, cyhal_gpio_t vminus, const cyhal_adc_channel_config_t* cfg)
{
    CY_ASSERT(obj != NULL);
    CY_ASSERT(adc != NULL);

    const uint32_t CYHAL_ADC_MIN_ACQUISITION_TIME_NS = 167;

    cy_rslt_t result = CY_RSLT_SUCCESS;

    memset(obj, 0, sizeof(cyhal_adc_channel_t));
    obj->vplus = NC;
    obj->vminus = NC;

    // Check for invalid pin or pin belonging to a different SAR
    const cyhal_resource_pin_mapping_t *vplus_map = _cyhal_adc_find_matching_resource(&(adc->resource), vplus,
        cyhal_pin_map_pass_sarmux_pads, sizeof(cyhal_pin_map_pass_sarmux_pads)/sizeof(cyhal_pin_map_pass_sarmux_pads[0]));
    const cyhal_resource_pin_mapping_t *vminus_map = NULL;

    if(NULL == vplus_map)
    {
        result = CYHAL_ADC_RSLT_BAD_ARGUMENT;
    }

    if(CY_RSLT_SUCCESS == result && CYHAL_ADC_VNEG != vminus)
    {
        vminus_map = _cyhal_adc_find_matching_resource(&(adc->resource), vminus, cyhal_pin_map_pass_sarmux_pads,
            sizeof(cyhal_pin_map_pass_sarmux_pads)/sizeof(cyhal_pin_map_pass_sarmux_pads[0]));
        if (NULL == vminus_map)
        {
            result = CYHAL_ADC_RSLT_BAD_ARGUMENT;
        }
    }

    if(CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_utils_reserve_and_connect(vplus, vplus_map);
    }

    if(CY_RSLT_SUCCESS == result)
    {
        obj->vplus = vplus;
        if(CYHAL_ADC_VNEG != vminus)
        {
            result = _cyhal_utils_reserve_and_connect(vminus, vminus_map);
        }
    }

    uint8_t chosen_channel = 0;

    if (CY_RSLT_SUCCESS == result)
    {
        obj->vminus = vminus;

        // Find the first available channel
        for(chosen_channel = 0; chosen_channel < CY_SAR_MAX_NUM_CHANNELS; ++chosen_channel)
        {
            if(NULL == adc->channel_config[chosen_channel])
            {
                break;
            }
        }
        if (chosen_channel >= CY_SAR_MAX_NUM_CHANNELS) // No channels available
            result = CYHAL_ADC_RSLT_NO_CHANNELS;
    }

    if(CY_RSLT_SUCCESS == result)
    {
        // Don't set the ADC until here so that free knows whether we have allocated
        // the channel on the parent ADC instance (and therefore doesn't try to free it if
        // something fails further up)
        obj->adc = adc;
        obj->channel_idx = chosen_channel;
        obj->adc->channel_config[chosen_channel] = obj;
        obj->minimum_acquisition_ns = (cfg->min_acquisition_ns > CYHAL_ADC_MIN_ACQUISITION_TIME_NS)
                                       ? cfg->min_acquisition_ns : CYHAL_ADC_MIN_ACQUISITION_TIME_NS;
    }

    if(CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_adc_populate_acquisition_timers(obj->adc);
    }

    if(CY_RSLT_SUCCESS == result)
    {
        uint32_t fw_ctrl_plus = _cyhal_adc_get_fw_switch_control(vplus, true);
        uint32_t mux_ctrl_plus = _cyhal_adc_get_mux_switch_control(vplus);
        Cy_SAR_SetAnalogSwitch(obj->adc->base, CY_SAR_MUX_SWITCH0, fw_ctrl_plus, CY_SAR_SWITCH_CLOSE);
        Cy_SAR_SetSwitchSarSeqCtrl(obj->adc->base, mux_ctrl_plus, CY_SAR_SWITCH_SEQ_CTRL_ENABLE);

        if(CYHAL_ADC_VNEG != vminus)
        {
            uint32_t fw_ctrl_minus = _cyhal_adc_get_fw_switch_control(vminus, false);
            uint32_t mux_ctrl_minus = _cyhal_adc_get_mux_switch_control(vminus);

            Cy_SAR_SetAnalogSwitch(obj->adc->base, CY_SAR_MUX_SWITCH0, fw_ctrl_minus, CY_SAR_SWITCH_CLOSE);
            Cy_SAR_SetSwitchSarSeqCtrl(obj->adc->base, mux_ctrl_minus, CY_SAR_SWITCH_SEQ_CTRL_ENABLE);
        }

        result = cyhal_adc_channel_configure(obj, cfg);
    }

    if(CY_RSLT_SUCCESS != result)
    {
        cyhal_adc_channel_free(obj);
    }

    return result;
}

cy_rslt_t cyhal_adc_channel_configure(cyhal_adc_channel_t *obj, const cyhal_adc_channel_config_t *config)
{
    CY_ASSERT(NULL != obj);

